#include <iostream>
#include <iomanip>
#include <string>
#include <fstream>
#include <vector>
#include <Windows.h>
using namespace std;

void Loader(short choise, vector <string>& lang) {
	system("chcp 1251");
	ofstream languages;
	string name = "";
	size_t n = lang.size();
	string strtemp;

	switch (choise) {
	case 0:

		name.append("Languages/english.bin");

		languages.open(name, ios::binary);

		break;
	case 1:

		name.append("Languages/russian.bin");

		languages.open(name, ios::binary);

		break;
	case 2:

		name.append("Languages/ukrainian.bin");

		languages.open(name, ios::binary);

		break;
	}

	if (languages.is_open()) {

		languages.write((char*)&n, sizeof(n));

		for (int i = 0; i < n; i++)
		{
			strtemp = lang[i];

			size_t size_str = strtemp.size();

			languages.write((char*)&size_str, sizeof(size_str));

			languages.write(strtemp.c_str(), size_str);
		}
	}
	else {
		system("cls");

		cout << "Ошибка при создании файла!" << endl;

		Sleep(500);

		system("cls");
	}
	languages.close();
	name.clear();
}

int main()
{
	system("chcp 1251");

	///////////////////////////////////////////////////////////////////////////

	vector<string> lang{
		//Errors
		"+~~~~~~~(Warning)~~~~~~~+\n | Your book is empty! |\n+=======================+\n",//0

		"+~~~~~~~(Warning)~~~~~~~+\n | Your file is empty! |\n+=======================+\n",//1

		"+~~~~~~~~~(Warning)~~~~~~~~~+\n | Entered unknown number! |\n+===========================+\n",//2

		"+~~~~~~~(Warning)~~~~~~+\n | File can not open! |\n+======================+\n",//3

		"",//4

		"+~~~~~~~~~(Warning)~~~~~~~~+\n | The user was not find! |\n+==========================+\n",//5

		"+~~~~~~~~(Warning)~~~~~~~~+\n | Incorrect name/phone! |\n+=========================+\n",//6

		"+~~~~~~~~~(Warning)~~~~~~~~+\n | Foud the same contact! |\n+==========================+\n",//7

		"+~~~~~~~~(Warning)~~~~~~~+\n | Name/Phone is empty! |\n+========================+\n",//8

		"+~~~~~~~(Warning)~~~~~~~~+\n | Name was overloaded! |\n+========================+\n",//9

		//Message

		"+~~~~~~~~~~~~(Message)~~~~~~~~~~~+\n |\tAdd some contacts!\t|\n+================================+\n",//10

		"+~~~~~~(Warning)~~~~~~+\n | File was renamed! |\n+=====================+\n",//11

		"+~~~~~~~~~~~~~~~~(Message)~~~~~~~~~~~~~~~+\n |\t   Your dire was saved!\t\t|\n | Tip: The file saved in imported_data |\n+========================================+\n",//12

		"+~~~~~~~~~~~(Message)~~~~~~~~~+\n | English language applied! |\n+=============================+\n",//13

		"+~~~~~~~~(Message)~~~~~~~+\n | Your file was loaded |\n+========================+\n",//14

		//Loader
		"[Searching for contact]",//15

		"[Dire]",//16

		"[Applying]",//17

		"[Adding]",//18

		"[Deleting]",//19

		"[Sorting]",//20

		"[Exporting]",//21

		"[Importing]",

		"[Settings]",

		"[Reading files]",

		"[Saving]",

		"[Leaving]",

		//Phone menu

		"+~~~~~~~Menu(Dire)~~~~~~~+\n | 1. List contacts\t|\n | 2. Search contact\t|\n | 3. Add contact\t|\n | 4. Sort contacts\t|\n | 5. Leave(ESC)\t|\n+========================+\n\nPress number...",

		"+~~~~~~~~~~~~~~~~~~(Adding)~~~~~~~~~~~~~~~~~~~+\n | Tip 1: Do not enter the same name(phone)! |\n | Tip 2: Max size of name - 16.\t     |\n | Tip 3: Size of phone number - 9 (10).     |\n+=============================================+\n\nEnter the name: ",

		"\n\nEnter the phone number: ",

		"+~~~~~~~~~~~~~~(Search contact)~~~~~~~~~~~~~~+\n | Tip: The name of the contact             |\n | you are looking for must be the same!    |\n+============================================+\n\nEnter contact name: ",

		"+~~~(Sorting contacts)~~~+\n | 1. A...Z\t\t|\n | 2. Z...A\t\t|\n | 3. Leave(ESC)\t|\n+========================+\n\nPress number...",

		//Contact
		"+~~~~~~~~~~~~~~~~~~~(Contact)~~~~~~~~~~~~~~~~~~+\n | Name: ",

		" | Phone: ",

		" |\n+==============================================+\n\n+~~~~~~(Settings)~~~~~+\n | 1. Rename contact |\n | 2. Delete contact |\n | 3. Leave(ESC)     |\n+=====================+\n\nPress number...",

		"+~~~~~~~~~~~~~~~~~(Rename)~~~~~~~~~~~~~~~+\n | Tip 1: (1. Rename | 2. Change phone) |\n | Tip 2: Do not enter the same name    |\n | Tip 3: Max size of name is 16        |\n+========================================+\n\nPress number...",

		"\n\nEnter new name(phone): ",

		//MainMenu
		"+~~~~~~~~~(Message)~~~~~~~+\n | Loadbar was turned on |\n+=========================+\n",

		"+~~~~~~~Main menu~~~~~~~~+\n | 1. Dire\t\t|\n | 2. Export data\t|\n | 3. Import data\t|\n | 4. Settings\t\t|\n | 5. Leave(Esc)\t|\n+========================+\n\nPress number...",

		"+~~~~~~~~~~~~~~~(Export data)~~~~~~~~~~~~~~~~+\n | Tip 1: Recommend variant of data - .bin. |\n | Tip 2: You can use .txt format.          |\n | Tip 3: Press ESC to leave.               |\n+============================================+\n\nEnter a name of file: ",

		"+~~~~~~~~~~(Message)~~~~~~~~~+\n | Auto save was turned on! |\n+============================+\n",//40

		"+~~~~~~~~~~~~~~(Import data)~~~~~~~~~~~~~~+\n | Tip 1: You can load your recent data! |\n | Tip 2: Press ESC to leave.            |\n+=========================================+\n\nEnter a name of file: ",

		//Settings
		"+~~~~~~~(Settings)~~~~~~~+\n | 1. Delay output\t|\n | 2. Random-add\t|\n | 3. Saving with format|\n | 4. Auto save\t\t|\n | 5. Leave(ESC)\t|\n+========================+\n\nPress number...",

		"+~~~~~~~(Language)~~~~~~~+\n | 1. Russian\t\t|\n | 2. English\t\t|\n | 3. Ukrainian\t\t|\n+========================+\n\nPress number...",

		"+~~~~~~~~~~~(Delay output)~~~~~~~~~~~+\n | Tip: Choose one variant          |\n | Tip 2: There are 3 types:        |\n | 1. Slow | 2. Middle | 3. Fast    |\n+====================================+\n\nPress number...",

		//Format file

		"+~~~~~~(Auto Format)~~~~~+\n | 1. Turn on format\t|\n | 2. Turn off format\t|\n | 3. Leave(ESC)\t|\n+========================+\n\nPress number...",

		"+~~~~~~(Type format)~~~~~+\n | 1. bin    | 2. txt\t|\n+========================+\n\nPress number...",

		//Functions
		//List

		"+~~~~~~~~~~~~~~~~~~~~~~~~(List contacts)~~~~~~~~~~~~~~~~~~~~~~~+\n",

		" |",

		".Nickname: ",

		" | Phone number: ",

		" |\n",

		"+==============================================================+\n\nEnter ESC to skip",

		//AddUser
		"+~~~~~~~~~~~~~~~~(The contact)~~~~~~~~~~~~~~~~+\n | Name: ",
		" | Phone: ",
		"|\n+==================(Added!)===================+\n",

		//Delete
		"|\n+==================(Deleted)==================+\n",

		//Auto Save
		"",///

		//Updated
		"[Renaming]",

		"+~~~~~~~~~~~~~~(Message)~~~~~~~~~~~~~~+\n",

		" | ",

		" |\n",

		" | Contact was succsesfully renamed! |\n+=====================================+\n",

		"[Loading]",

		"+~~~~~~~~~~~~~~(Warning)~~~~~~~~~~~~~~+ \n | That language was already applied!| \n+=====================================+\n",

		"+~~~~~~~~~~~~~(Warning)~~~~~~~~~~~~+\n | One contact can not be sorted! |\n+==================================+\n",

		"+~~~~~~(Message)~~~~~+\n | Account deleted! |\n+====================+",

		"+~~~~~~~~~~~~~~~~~(Test)~~~~~~~~~~~~~~~~~+\n | Tip: Massive adding contacts!\t|\n | Tip: Choose amount of random\t\t|\n | generated contacts\t\t        |\n | Tip: A lot of memory may be required |\n | during a stress-test!\t\t|\n+========================================+\n\nEnter amount of contacts: ",

		"[Massive add]",

		"+~~~~~~~~~(Message)~~~~~~~~+ \n | Loadbar was turned off | \n+==========================+\n",

		"+~~~~~~~(Loadbar)~~~~~~~+\n | 1. Turn on loadbar  |\n | 2. Turn off loadbar |\n+=======================+\n\nPress number...",

		//Update login
		"+~~~~~~~~~~~~(Message)~~~~~~~~~~~~+\n | Account succsesfully created! |\n+=================================+\n",

		"+~~~~~~~~~~(Message)~~~~~~~~~~+\n | You succsesfully entered! |\n+=============================+\n",

		"+~~~~~~~~(Message)~~~~~~~~+\n | Wrong login/password! |\n+=========================+\n",

		"+~~~~~~~~~~~~~(Warning)~~~~~~~~~~+\n | Your account does not exist! |\n+================================+\n",

		"+~~~~~~~~~~~~(Warning)~~~~~~~~~~+\n | Your account already exist! |\n+===============================+\n",

		"+~~~~~~~~~(Login)~~~~~~~~+\n | 1. Log in\t\t|\n | 2. Sign in\t\t|\n | 3. Change login data\t|\n | 4. Delete user\t|\n | 5. Change language\t|\n | 6. Leave(ESC)\t|\n+========================+\n\nPress number...",

		"+~~~~~~~~~~~(Log in)~~~~~~~~~+\n | Enter login and password |\n+============================+\n",

		"+~~~~~~~~~~(Sign in)~~~~~~~~+\n | Pick login and password |\n+===========================+\n",

		"+~~~~~~(Change data)~~~~~+\n | 1. Change login\t|\n | 2. Change password\t|\n+========================+\n\nPress number...",

		"+~~~~~~~~~~~~~(Change data)~~~~~~~~~~~~+\n | Before changing login and password |\n | please log in!\t\t      |\n+======================================+\n",

		"\nLogin: ",

		"\n\nPassword: ",

		"\n\nNew login: ",

		"\n\nNew password: ",
		//delete account
		"+~~~~~~~~~~~~~(Deleting account)~~~~~~~~~~~~+\n | Before deleting account, please log in! |\n+===========================================+\n",

		"+~~~~~~~~~~~~~~~~~~~(Warning)~~~~~~~~~~~~~~~~~~+\n | Do you really want to delete your account? |\n |\t\t(1. YES | 2. NO)	      |\n+==============================================+\n\nPress number...",
		//check pass
		"+~~~~~~~(Warning)~~~~~~~~+\n | To small login/pass! |\n+========================+\n",
		"+~~~~~~~~~(Message)~~~~~~~~~+\n | Your account was deleted |\n+===========================+\n",
		//sort
		"+~~~~~~~~~~~~(Message)~~~~~~~~~~~~+\n | Your dire succsesfully sorted |\n+=================================+\n",
		//Massive add
		"+~~~~~~~~~~~~~~~~(Message)~~~~~~~~~~~~~~~+\n | How much contact do you like to add? |\n+========================================+\n\nPress number  1 to 6...",
		//Auto
		"+~~~~~(Auto save)~~~~+\n | 1. Turn on\t    |\n | 2. Turn  off\t    |\n | 3. Leave(ESC)    |\n+====================+\n\nPress number...",

		"+~~~~~~~~~~(Message)~~~~~~~~~+\n | Auto save was turned off |\n+============================+\n",

		"\nType password again: ",

		"+~~~~~~~~~~~~~(Warning)~~~~~~~~~~~~~~+\n | Your second pass is not correct! |\n+====================================+\n",

		"title Account menu",

		"title Main menu of Dire",

		"title Menu of Dire",

		"title Choose language",

		"title Menu of settings",

		"title Contact preferences",

		"title Choose delay of output", //101

		"title Save your file with format", //102

		"title Automatically saves user data", //103

		"title Add a new contact",//104

		"title List all of your contacts",//105

		"title Enter 3-4 simbols to find your contact", //106

		"title Sort your dire!",//107

		"title Login to existing account",//108

		"title Create a new account",//109

		"title Change your account data",//110

		"title Delete your account of data base", //111

		"title Export data, do not forget, you have an auto format type", //112

		"title Import data", //113
	};

	vector<string> lang2{
		//Errors
		"+~~~~(Предупреждение)~~~+\n | Ваша книжка пустая! |\n+=======================+\n",//0

		"+~~(Предупреждение)~~+\n | Ваш файл пустой! |\n+====================+\n",//1

		"+~~~~(Предупреждение)~~~+\n | Неправильный выбор! |\n+=======================+\n",//2

		"+~~~~~~~(Предупреждение)~~~~~~~+\n | Файл не может быть открыт! |\n+==============================+\n",//3

		"",//4

		"+~~~(Предупреждение)~~~+\n | Контакт не найден! |\n+======================+\n", //5

		"+~~~~~(Предупреждение)~~~~~~+\n | Неправильное имя/номер! |\n+===========================+\n", //6

		"+~~~~~(Предупреждение)~~~~+\n | Найдено такое же имя! |\n+=========================+\n", //7

		"+~~~~~~~~(Предупреждение)~~~~~~~+\n |    Имя/Номер пустое(й)!     |\n+===============================+\n", //8

		"+~~~~(Предупреждение)~~~+\n | Имя перегружено!    |\n+=======================+\n", //9


		//Message
		"+~~~~~~~~~~~(Сообщение)~~~~~~~~~~+\n |\tДобавьте контакт!\t|\n+================================+\n", //10

		"+~~~~~~~(Сообщение)~~~~~~+\n |  Файл переименован!  |\n+========================+\n", //11

		"+~~~~~~~~~~~~~~(Сообщение)~~~~~~~~~~~~~+\n | Ваши данные сохранены\t      |\n | Tip: Находятся папке imported_data |\n+======================================+\n",//12

		"+~~~~~~~~(Сообщение)~~~~~~~+\n | Применен Русcкий язык! |\n+==========================+\n",//13

		"+~~~~~~~~(Сообщение)~~~~~~~+\n | Ваши данные загружены! |\n+==========================+\n",//14

		//Loader
		"[Поиск]", //15

		"[Книга]", //16

		"[Применение]", //17

		"[Добавление]",//18

		"[Удаление]",//19

		"[Сортировка]",//20

		"[Экспорт]",//21

		"[Импорт]",//22

		"[Настройки]",//23

		"[Загрузка файлов]",//24

		"[Сохранение]",//25

		"[Выход]",//26

		//Phone menu
		"+~~~~~~~~Меню (Книга)~~~~~~~+\n | 1. Список контактов\t   |\n | 2. Поиск контактов\t   |\n | 3. Добавить контакт\t   |\n | 4. Сортировать контакты |\n | 5. Выход(ESC)\t   |\n+===========================+\n\nНажмите цифру...", //27

		"+~~~~~~~~~~~~~~~~(Добавление)~~~~~~~~~~~~~~~~~+\n | Tip 1: Не вводите одинаковое имя/телефон! |\n | Tip 2: Максимальная длина имени - 16.     |\n | Tip 3: Максимальная длина номера - 10.    |\n+=============================================+\n\nВведите имя: ", //28

		"\n\nВведите номер телефона: ",//29

		"+~~~~~~~~~~~~(Поиск контакта)~~~~~~~~~~~~+\n | Tip: Имя контакта которое            |\n | вы ищите, должно быть одинаковое!    |\n+========================================+\n\nВведите имя контакта: ", //30

		"+~~~~~~(Сортировка)~~~~~~+\n |     1. A...Я\t\t|\n |     2. Я...A\t\t|\n |     3. Выход(ESC)\t|\n+========================+\n\nНажмите цифру...", //31

		//Contact

		"+~~~~~~~~~~~~~~~~~~~~(Контакт)~~~~~~~~~~~~~~~~~~+\n | Имя: ", //32

		" | Телефон: ",//33

		" |\n+===============================================+\n\n+~~~~~(Настройки)~~~~+\n | 1. Переименовать |\n | 2. Удалить       |\n | 3. Выход(ESC)    |\n+====================+\n\nНажмите цифру...",//34

		"+~~~~~~~~~~~~~~(Переименование)~~~~~~~~~~~~~+\n | Tip 1: (1. Имя | 2. Телефон)            |\n | Tip 2: Не вводите тоже самое имя!       |\n | Tip 3: Максимальная длина имени - 16.   |\n+===========================================+\n\nНажмите цифру...",//35

		"\n\nВведите новое имя/телефон: ",//36

		//MainMenu/Loading

		"+~~~~~(Сообщение)~~~~+\n | Лоад-бар включен |\n+====================+\n",//37 setting()

		"+~~~~~~~~Main меню~~~~~~~+\n | 1. Книжка\t\t|\n | 2. Экспорт данных\t|\n | 3. Импорт данных\t|\n | 4. Настройки\t\t|\n | 5. Выход(Esc)\t|\n+========================+\n\nНажмите цифру...",//38

		"+~~~~~~~~~~~~~~~~~(Экспорт данных)~~~~~~~~~~~~~~~~~+\n | Tip 1: Рекомендуемый формат данных - .bin.     |\n | Tip 2: Вы можете использовать .txt.            |\n | Tip 3: Пропуск формата ЕСК.                    |\n+==================================================+\n\nВведите имя файла: ", //39

		"+~~~~~~~~~(Сообщение)~~~~~~~~+\n | Автосохранение включено! |\n+============================+\n",//40............................

		"+~~~~~~~~~~~~~~~~(Импорт данных)~~~~~~~~~~~~~~~~+\n | Tip 1: Вы можете загрузить недавние данные! |\n | Tip 2: Нажмите ЕСК чтобы выйти.             |\n+===============================================+\n\nВведите имя файла: ",//41

		//Settings

		"+~~~~~~~~~(Настройки)~~~~~~~~+\n | 1. Задержка вывода\t    |\n | 2. Рандом-тест\t    |\n | 3. Сохранение с форматом |\n | 4. Авто-сохранение\t    |\n | 5. Выход(ESC)\t    |\n+============================+\n\nНажмите цифру...",//42

		"+~~~~~~(Язык)~~~~~+\n | 1. Руский\t |\n | 2. Английский |\n | 3. Украинский |\n+=================+\n\nНажмите цифру...",//43

		"+~~~~~~~~~~~(Задержка вывода)~~~~~~~~~~~+\n | Tip: Выберите один вариант          |\n | Tip 2: Есть 3 вида задержки:        |\n | 1. Медленно | 2. Средне | 3. Быстро |\n+=======================================+\n\nНажмите цифру...",//44

		//format type

		"+~~~~~~~~(Формат)~~~~~~~~+\n | 1. Включить формат\t|\n | 2. Выключить формат\t|\n | 3. Выйти(ESC)\t|\n+========================+\n\nНажмите цифру...",//45

		"+~~~~~(Выбор формата)~~~~+\n | 1. bin    | 2. txt\t|\n+========================+\n\nНажмите цифру...",//46

		//Functions

		//List
		"+~~~~~~~~~~~~~~~~~~~~(Список контактов)~~~~~~~~~~~~~~~~~~~~~+\n",//47

		" |",//48

		".Имя: ",//49

		" | Номер телефона: ",//50

		" |\n",//51

		"+===========================================================+\n\nНажмите ESC для выхода...\n",//52

		//AddUser

		"+~~~~~~~~~~~~~~~~~~(Контакт)~~~~~~~~~~~~~~~~~~+\n | Name: ",//53

		" | Phone: ",//54

		"|\n+=================(Добавлен)==================+\n",//55

		//Delete

		"|\n+===================(Удален)==================+\n",//56

		//AutoSave

		"",//57

		//Updated 0.1

		"[Переименование]", //58+

		"+~~~~~~~~~~~~~(Сообщение)~~~~~~~~~~~~~+\n",//59+

		" | ",//60+

		" |\n",//61+

		" | Контакт успешно переименован!     |\n+=====================================+\n", //62

		"[Загрузка]", //63

		"+~~~~~~(Предупреждение)~~~~~+\n | Этот язык уже применен! |\n+===========================+\n",//64

		"+~~~~~~~~~~~~~~(Предупреждение)~~~~~~~~~~~~~~+\n | Один контакт не может быть отсортирован! |\n+============================================+\n",//65

		"+~~~~~~~~~(Cообщение)~~~~~~~~~+\n | Очистка данных завершена! |\n+=============================+",//66+

		//Updated 0.2

		"+~~~~~~~~~~~~~~~~(Тест)~~~~~~~~~~~~~~~~+\n | Tip: Массовое добавление контактов |\n | Tip: Выберите количество рандомно  |\n | сгенерированных контактов          |\n | Tip: Из-за большого количества     |\n | может потребоватся много памяти!   |\n+======================================+\n\nВведите количество контактов: ",//67

		"[Массовое добавление]",//68

		//Updated 0.3

		"+~~~~~(Сообщение)~~~~~+\n | Лоад-бар выключен |\n+=====================+\n",//69

		"+~~~~(Лоад-бар)~~~+\n | 1. Включить   |\n | 2. Выключить  |\n+=================+\n\nНажмите цифру...",//70

		//Update login

		"+~~~~~~~~(Сообщение)~~~~~~~~+\n | Аккаунт успешно создан! |\n+===========================+\n", //71

		"+~~~~~~(Сообщение)~~~~~~+\n | Вы вошли в аккаунт! |\n+=======================+\n",//72

		"+~~~~~~~~(Сообщение)~~~~~~~+\n | Неверный логин/пароль! |\n+==========================+\n", //73

		"+~~~~~~~~~~(Предупреждение)~~~~~~~~+\n | Такого аккаунта не существует! |\n+==================================+\n",//74

		"+~~~~~~~~(Предупреждение)~~~~~~~+\n | Ваш аккаунт уже существует! |\n+===============================+\n", //75

		"+~~~~~~~~~(Логин)~~~~~~~~+\n | 1. Войти в аккаунт\t|\n | 2. Создать аккаунт\t|\n | 3. Сменить данные\t|\n | 4. Удалить аккаунт\t|\n | 5. Сменить язык\t|\n | 6. Выход(ESC)\t|\n+========================+\n\nНажмите цифру...",//76

		"+~~~~~~~~~~~(Вход)~~~~~~~~~+\n | Впишите логин и пароль |\n+==========================+\n",//77

		"+~~~~~~~~~(Регистрация)~~~~~~~+\n | Придумайте логин и пароль |\n+=============================+\n",//78

		"+~~~~~(Смена данных)~~~~~+\n | 1. Сменить логин\t|\n | 2. Сменить пароль\t|\n+========================+\n\nНажмите цифру...",//79

		"+~~~~~~~~~~~(Смена данных)~~~~~~~~~~+\n | Перед сменой войдите в аккаунт! |\n+===================================+\n",//80

		"\nЛогин: ",//81

		"\n\nПароль: ",//82

		"\n\nНовый логин: ",//83

		"\n\nНовый пароль: ",//84

		"+~~~~~~~~~~~(Удаление данных)~~~~~~~~~~+\n | Перед удалением войдите в аккаунт! |\n+======================================+\n",//85

		"+~~~~~~~~~~(Предупреждение)~~~~~~~~~~+\n | Вы точно хотите удалить аккаунт? |\n |\t    (1. Да | 2. Нет)	    |\n+====================================+\n\nНажмите цифру...",//86

		"+~~~~~~(Предупреждение)~~~~~+\n | Маленький логин/пароль! |\n+===========================+\n",//87

		"+~~~~~~~~(Сообщение)~~~~~~~+\n | Аккаунт успешно удален! |\n+==========================+\n",//88

		"+~~~~~~~(Сообщение)~~~~~~~+\n | Книжка отсортирована! |\n+=========================+\n",//89

		//Massive add
		"+~~~~~~~~~~~~~~~~(Сообщение)~~~~~~~~~~~~~~+\n | Сколько контактов Вы хотите добавить? |\n+=========================================+\n\nНажмите цифру от 1 до 6...",//90
		//Auto save
		"+~~~~(Автосохранение)~~~~~+\n |\t1. Включить\t |\n |\t2. Выключить\t |\n |\t3. Выйти(ESC)    |\n+=========================+\n\nНажмите цифру...",//91
		"+~~~~~~~~~~(Сообщение)~~~~~~~~~~+\n | Автосохранение выключено!  |\n+===============================+\n",//92
		"\nПовторите пароль: ",//93
		"+~~~~~~~~~~(Предупреждение)~~~~~~~~~~+\n | Вы неправильно повторили пароль! |\n+====================================+\n",//94

		"title Меню аккаунтов",

		"title Главное меню книги",

		"title Меню книги",

		"title Выбор языка",

		"title Меню настроек",

		"title Меню настройки контакта",

		"title Выберите задержку вывода текста", //101

		"title Сохраните файл сразу с форматом", //102

		"title Автоматическое сохранение данных пользователя", //103

		"title Добавьте новый контакт",//104

		"title Список всех ващих контактов",//105

		"title Введите хотя бы 3-4 символа для поиска контакта", //106

		"title Отсортируйте свою книгу!",//107

		"title Вход в аккаунт",//108

		"title Создание нового аккаунта",//109

		"title Смена данных аккаунта",//110

		"title Удаление аккаунта из базы данных",//111

		"title Экспорт данных, незабывайте про автоматический формат",//112

		"title Импорт данных",//113
	};

	vector<string> lang3{
		//Errors
		"+~~~~~(Попередження)~~~~~+\n | Ваша книжка порожня! |\n+========================+\n",//0

		"+~~~(Попередження)~~~+\n | Ваш файл пустий! |\n+====================+\n",//1

		"+~~~~~(Попередження)~~~~+\n | Неправильний вибір! |\n+=======================+\n",//2

		"+~~~~~~~~~(Попередження)~~~~~~~~~+\n | Файл не може бути відкритим! |\n+================================+\n",//3

		"",//4

		"+~~~~~(Попередження)~~~~+\n | Контакт не знайден! |\n+=======================+\n", //5

		"+~~~~~~(Попередження)~~~~~~~+\n | Неправильне ім'я/номер! |\n+===========================+\n", //6

		"+~~~~~~(Попередження)~~~~~~+\n | Знайдено таке ж ім'я!  |\n+==========================+\n", //7

		"+~~~~~~~~~(Попередження)~~~~~~~~+\n |    Ім'я/Номер пусте(ий)!    |\n+===============================+\n", //8

		"+~~~~~(Попередження)~~~~+\n | Ім'я перегружено!   |\n+=======================+\n", //9


		//Message
		"+~~~~~~~~~(Повідомлення)~~~~~~~~~+\n |\tДодайте контакт!\t|\n+================================+\n", //10

		"+~~~~~(Повідомлення)~~~~~+\n |  Файл перейменован!  |\n+========================+\n", //11

		"+~~~~~~~~~~~~~~(Повідомлення)~~~~~~~~~~~~~~+\n |            Ваші дані збережені\t  |\n | Tip: Знаходяться у папці imported_data |\n+==========================================+\n",//12

		"+~~~~~~~~~~(Повідомлення)~~~~~~~~+\n | Застосовано українську мову! |\n+================================+\n",//13

		"+~~~~~~~(Повідомлення)~~~~~+\n | Ваші дані завантажено! |\n+==========================+\n",//14

		//Loader
		"[Пошук контакта]", //15

		"[Книга]", //16

		"[Застосування]", //17

		"[Додавання]",//18

		"[Видалення]",//19

		"[Сортування]",//20

		"[Експорт]",//21

		"[Імпорт]",//22

		"[Налаштування]",//23

		"[Завантаження файлів]",//24

		"[Збереження]",//25

		"[Вихід]",//26

		//Phone menu
		"+~~~~~~~Меню (Книга)~~~~~~~~+\n | 1. Список контактів\t   |\n | 2. Пошук контактів\t   |\n | 3. Додати контакт\t   |\n | 4. Сортувати контакти   |\n | 5. Вихід(ESC)\t   |\n+===========================+\n\nНатисніть цифру...\n", //27

		"+~~~~~~~~~~~~~~~~(Додавання)~~~~~~~~~~~~~~~~~+\n | Tip 1: Не вводьте однакове ім'я/телефон! |\n | Tip 2: Максимальна довжина імені - 16.   |\n | Tip 3: Максимальна довжина телефона - 10.|\n+============================================+\n\nВведіть ім'я: ", //28

		"\n\nВведіть номер телефона: ",//29

		"+~~~~~~~~~~~(Пошук контактів)~~~~~~~~~~+\n | Tip: Ім'я контакта яке ви шукаєте, |\n | повинно бути схожим!\t\t      |\n+======================================+\n\nВведіть ім'я контакта: ", //30

		"+~~~~~~(Сортування)~~~~~~+\n |     1. A...Я\t\t|\n |     2. Я...A\t\t|\n |     3. Вихід(ESC)\t|\n+========================+\n\nНатисніть цифру...", //31

		//Contact

		"+~~~~~~~~~~~~~~~~~~~~~(Контакт)~~~~~~~~~~~~~~~~~~+\n | Ім'я: ", //32

		" | Телефон: ",//33

		" |\n+================================================+\n\n+~~~(Налаштування)~~~+\n | 1. Перейменувати |\n | 2. Видалити\t    |\n | 3. Вихід(ESC)    |\n+====================+\n\nНатисніть цифру...",//34

		"+~~~~~~~~~~~~~~(Перейменування)~~~~~~~~~~~~~+\n | Tip 1: (1. Ім'я | 2. Телефон)           |\n | Tip 2: Не вводьте таке ж ім'я!\t   |\n | Tip 3: Максимальна довжина імені - 16.  |\n+===========================================+\n\nНатисніть цифру...",//35

		"\n\nВведіть нове ім'я/телефон: ",//36

		//MainMenu/Loading

		"+~~~~(Повідомлення)~~~+\n | Лоад-бар увімкнен |\n+=====================+\n",//37 setting()

		"+~~~~~~(Головне меню)~~~~+\n | 1. Телефонна книга\t|\n | 2. Експорт даних\t|\n | 3. Імпорт даних\t|\n | 4. Налаштування\t|\n | 5. Вихід(Esc)\t|\n+========================+\n\nНатисніть цифру...",//38

		"+~~~~~~~~~~~~~~~~~~(Експорт даних)~~~~~~~~~~~~~~~~~~~+\n | Tip 1: Рекомендуємий формат даних - .bin.        |\n | Tip 2: Ви можете використовувати - .txt.         |\n | Tip 3: Формат встановлюється у налаштуванні ЕСК. |\n+====================================================+\n\nВведіть ім'я файла: ", //39

		"+~~~~~~~~(Повідомлення)~~~~~~~+\n | Автозбереження увімкнено! |\n+=============================+\n",//40

		"+~~~~~~~~~~~~~~~~~~~~~~~(Імпорт даних)~~~~~~~~~~~~~~~~~~~~~~+\n | Tip 1: Формат встановлюється програмою!\t\t   |\n | Tip 2: Зайдіть у меню налаштування, щоб змінити формат. |\n+===========================================================+\n\nВведіть ім'я файла: ",//41

		//Settings

		"+~~~~~~~~(Налаштування)~~~~~~+\n | 1. Затримка виведення    |\n | 2. Рандом-текст\t    |\n | 3. Формат файла\t    |\n | 4. Авто-збереження\t    |\n | 5. Вихід(ESC)\t    |\n+============================+\n\nНатисніть цифру...",//42

		"+~~~~~~(Мова)~~~~~+\n | 1. Російська\t |\n | 2. Англійська |\n | 3. Українська |\n+=================+\n\nНатисніть цифру...",//43

		"+~~~~~~~~~~~(Затримка виведення)~~~~~~~~~~+\n | Tip: Оберіть один варіант!            |\n | Tip 2: Є 3 типи затримки:             |\n | 1. Повільно | 2. Середньо | 3. Швидко |\n+=========================================+\n\nНатисніть цифру...",//44

		//format type

		"+~~~~~~~~(Формат)~~~~~~~~+\n | 1. Увімкнути формат\t|\n | 2. Вимкнути формат\t|\n | 3. Вийти(ESC)\t|\n+========================+\n\nНатисніть цифру...",//45

		"+~~~~~(Вибір формата)~~~~+\n | 1. bin    | 2. txt\t|\n+========================+\n\nНатисніть цифру...",//46

		//Functions

		//List
		"+~~~~~~~~~~~~~~~~~~~~~(Список контактів)~~~~~~~~~~~~~~~~~~~~~+\n",//47

		" |",//48

		".Ім'я: ",//49

		" | Номер телефона: ",//50

		" |\n",//51

		"+============================================================+\n\nНатисніть ESC для вихіда...\n",//52

		//AddUser

		"+~~~~~~~~~~~~~~~~~~~(Контакт)~~~~~~~~~~~~~~~~~~~+\n | Ім'я: ",//53

		" | Телефон: ",//54

		"|\n+====================(Додан)====================+\n",//55

		//Delete

		"|\n+====================(Видален)==================+\n",//56

		//AutoSave

		"+~~~~(Автозбереження)~~~~+\n |\t1. Увімкнути\t|\n |\t2. Вимкнути\t|\n |\t3. Вийти (ESC)\t|\n+========================+\n\nНатисніть цифру...",//57

		//Updated 0.1

		"[Перейменування]", //58+

		"+~~~~~~~~~~~~(Повідомлення)~~~~~~~~~~~+\n",//59+

		" | ",//60+

		" |\n",//61+

		" | Контакт успішно перейменован!     |\n+=====================================+\n", //62

		"[Завантаження]", //63

		"+~~~~~~~~~~(Попередження)~~~~~~~~~+\n | Ця мова вже використовується! |\n+=================================+\n",//64

		"+~~~~~~~~~~~~~~(Попередження)~~~~~~~~~~~~~~+\n | Один контакт не може бути відсортован! |\n+==========================================+\n",//65

		"+~~~~~~~~(Повідомлення)~~~~~~~+\n | Очищення даних закінчено! |\n+=============================+",//66+

		//Updated 0.2

		"+~~~~~~~~~~~~~~~~~(Тест)~~~~~~~~~~~~~~~~~+\n | Tip: Масове додавання контактів.     |\n | Tip: Виберіть кількість\t\t|\n | згенерованих контактів\t\t|\n | Tip: Для великої кількості контактів |\n | може знадобитись багато пам'яті!     |\n+========================================+\n\nВведіть кількість контактів: ",//67

		"[Масове додавання]",//68

		//Updated 0.3

		"+~~~~~(Повідомлення)~~~~+\n | Лоад-бар вимкнен |\n+====================+\n",//69

		"+~~~~(Лоад-бар)~~~+\n | 1. Увімкнути   |\n | 2. Вимкнути  |\n+=================+\n\nНатисніть цифру...",//70

		//Update login

		"+~~~~~~~(Повідомлення)~~~~~~~+\n | Аккаунт успішно створен! |\n+============================+\n", //71

		"+~~~~~~(Повідомлення)~~~~~+\n | Ви увійшли в аккаунт! |\n+=========================+\n",//72

		"+~~~~~~~~(Повідомлення)~~~~~~~~+\n | Неправильний логін/пароль! |\n+==============================+\n", //73

		"+~~~~~~~~(Повідомлення)~~~~~~~+\n | Такого аккаунта не існує! |\n+=============================+\n",//74

		"+~~~~~~~(Повідомлення)~~~~~+\n | Ваш аккаунт вже існує! |\n+==========================+\n", //75

		"+~~~~~~~~~(Логін)~~~~~~~~+\n | 1. Увійти в аккаунт\t|\n | 2. Створити аккаунт\t|\n | 3. Змінити дані\t|\n | 4. Видалити аккаунт\t|\n | 5. Змінити мову\t|\n | 6. Вихід (ESC)\t|\n+========================+\n\nНатисніть цифру...",//76

		"+~~~~~~~~~~~(Вхід)~~~~~~~~~+\n | Впишіть логін і пароль |\n+==========================+\n",//77

		"+~~~~~~~~~(Реєстрація)~~~~~~~~+\n | Придумайте логін і пароль |\n+=============================+\n",//78

		"+~~~~~~(Зміна даних)~~~~~+\n | 1. Змінити логін\t|\n | 2. Змінити пароль\t|\n+========================+\n\nНатисніть цифру...",//79

		"+~~~~~~~~~~~~~(Зміна даних)~~~~~~~~~~~~+\n | Перед зміной увійдіть до аккаунта! |\n+======================================+\n",//80

		"\nЛогін: ",//81

		"\n\nПароль: ",//82

		"\n\nНовий логін: ",//83

		"\n\nНовий пароль: ",//84

		"+~~~~~~~~~~~~~(Видалення даних)~~~~~~~~~~~~+\n | Перед видаленням увійдіть до аккаунта! |\n+==========================================+\n",//85

		"+~~~~~~~~~~~~(Попередження)~~~~~~~~~~~+\n | Ви точно хочете видалити аккаунт? |\n |\t    (1. Так | 2. Ні)	     |\n+=====================================+\n\nНатисніть цифру...",//86

		"+~~~~~~~(Попередження)~~~~~~+\n | Маленький логін/пароль! |\n+===========================+\n",//87

		"+~~~~~~~~(Повідомлення)~~~~~~+\n | Аккаунт успішно видален! |\n+============================+\n",//88

		"+~~~~~(Повідомлення)~~~~+\n | Книга відсортована! |\n+=======================+\n",//89

		//Massive add
		"+~~~~~~~~~~~~~(Повідомлення)~~~~~~~~~~~~+\n | Скільки контактів Ви хочете додати? |\n+=======================================+\n\nНатисніть цифру від 1 до 6...",//90
		//Auto save
		"+~~~~~(Автозбереження)~~~~+\n |\t1. Увімкнути\t|\n |\t2. Вимкнути\t|\n |\t3. Вийти (ESC)  |\n+=========================+\n\nНатисніть цифру...",//91

		"+~~~~~~~(Повідомлення)~~~~~~~+\n | Автозбереження вимкнуто! |\n+============================+\n",//92

		"\nПовторіть пароль: ",//93

		"+~~~~~~~~~(Попередження)~~~~~~~~~+\n | Ви неправильно ввели пароль! |\n+================================+\n",//94

		//title of console
		"title Меню аккаунтів", //95

		"title Головне меню книги", //96

		"title Меню книги", //97

		"title Вибір мови", //98

		"title Меню налаштувань", //99

		"title Налаштування контакта", //100

		"title Виберіть затримку виведення тексту", //101

		"title Збережіть свій файл відразу з форматом", //102

		"title Автоматичне збереження даних користувача", //103

		"title Додайте новий контакт",//104

		"title Список всіх ваших контактів",//105

		"title Ввведіть хоча б 3-4 літери для пошуку контакта", //106

		"title Відсортуйте свої контакти!",//107

		"title Увійдіть в аккаунт",//108

		"title Створення нового аккаунта",//109

		"title Змінення даних аккаунта",//110

		"title Видалення аккаунта із бази даних",//111

		"title Експорт даних, не забувайте про автоматичний формат!",//112

		"title Імпорт даних", //113
	};

	///////////////////////////////////////////////////////////////////////////

	Loader(0, lang);
	Loader(1, lang2);
	Loader(2, lang3);
}